# Time Methods in Pandas  
```
Basic Python has a datetime object containing data and time information 

Pandas allows us to easily extract information from a datatime object to use feature engineering 
```

In [12]:
import numpy as np
import pandas as pd

In [13]:
from datetime import datetime

# Basic Python's datetime

In [14]:
myyear = 2024
mymonth = 5
myday = 23
myhour = 5
mymin = 30
mysec = 15

In [15]:
mydate = datetime(myyear,mymonth,myday)
mydate

datetime.datetime(2024, 5, 23, 0, 0)

In [16]:
mydatetime = datetime(myyear,mymonth,myday,myhour,mymin,mysec)
mydatetime

datetime.datetime(2024, 5, 23, 5, 30, 15)

In [17]:
mydatetime.year

2024

# Using Pandas

In [18]:
myser = pd.Series(['Nov 3 , 1990','2000-01-01',None])
myser

0    Nov 3 , 1990
1      2000-01-01
2            None
dtype: object

In [19]:
myser[0]

'Nov 3 , 1990'

In [31]:
myser

0    Nov 3 , 1990
1      2000-01-01
2            None
dtype: object

In [32]:
pd.to_datetime(myser[0])

Timestamp('1990-11-03 00:00:00')

In [21]:
timeser = pd.to_datetime(myser)

ValueError: time data "2000-01-01" doesn't match format "%b %d , %Y", at position 1. You might want to try:
    - passing `format` if your strings have a consistent format;
    - passing `format='ISO8601'` if your strings are all ISO8601 but not necessarily in exactly the same format;
    - passing `format='mixed'`, and the format will be inferred for each element individually. You might want to use `dayfirst` alongside this.

In [22]:
timeser[0].year

NameError: name 'timeser' is not defined

In [23]:
obvi_euro_date = '31-12-2000'

In [24]:
pd.to_datetime(obvi_euro_date)

/var/folders/_t/0rqjywnx1_z3rvn8xgy9yhg00000gn/T/ipykernel_20666/163700324.py:1: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  pd.to_datetime(obvi_euro_date)

Timestamp('2000-12-31 00:00:00')

In [25]:
euro_date = '10-12-2000'

In [26]:
pd.to_datetime(euro_date)

Timestamp('2000-10-12 00:00:00')

In [27]:
pd.to_datetime(euro_date,dayfirst=True)

Timestamp('2000-12-10 00:00:00')

In [28]:
pd.to_datetime('Nov 3, 1990')

Timestamp('1990-11-03 00:00:00')

In [29]:
pd.to_datetime('2000-01-01')

Timestamp('2000-01-01 00:00:00')

In [30]:
pd.to_datetime(None)

In [33]:
style_date = '12--Dec--2000'

In [34]:
pd.to_datetime(style_date,format='%d--%b--%Y')

Timestamp('2000-12-12 00:00:00')

In [35]:
custom_date = "12th of Dec 2000"

In [36]:
pd.to_datetime(custom_date)

Timestamp('2000-12-12 00:00:00')

In [39]:
sales = pd.read_csv("data/RetailSales_BeerWineLiquor.csv")
sales

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
335  2019-12-01           6630
336  2020-01-01           4388
337  2020-02-01           4533
338  2020-03-01           5562
339  2020-04-01           5207

[340 rows x 2 columns]

In [41]:
sales['DATE'] = pd.to_datetime(sales['DATE'])

In [42]:
sales

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [43]:
sales['DATE'][0]

Timestamp('1992-01-01 00:00:00')

In [44]:
sales['DATE'][0].year

1992

In [45]:
sales = pd.read_csv("data/RetailSales_BeerWineLiquor.csv",parse_dates=[0])
sales

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [46]:
sales['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [47]:
sales

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [48]:
sales = sales.set_index('DATE')

In [50]:
sales.resample(rule='A').mean()

/var/folders/_t/0rqjywnx1_z3rvn8xgy9yhg00000gn/T/ipykernel_20666/229365907.py:1: FutureWarning: 'A' is deprecated and will be removed in a future version, please use 'YE' instead.
  sales.resample(rule='A').mean()

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000
1997-12-31    2006.750000
1998-12-31    2115.166667
1999-12-31    2206.333333
2000-12-31    2375.583333
2001-12-31    2468.416667
2002-12-31    2491.166667
2003-12-31    2539.083333
2004-12-31    2682.416667
2005-12-31    2797.250000
2006-12-31    3001.333333
2007-12-31    3177.333333
2008-12-31    3292.000000
2009-12-31    3353.750000
2010-12-31    3450.083333
2011-12-31    3532.666667
2012-12-31    3697.083333
2013-12-31    3839.666667
2014-12-31    4023.833333
2015-12-31    4212.500000
2016-12-31    4434.416667
2017-12-31    4602.666667
2018-12-31    4830.666667
2019-12-31    4972.750000
2020-12-31    4922.500000

In [51]:
sales = pd.read_csv("data/RetailSales_BeerWineLiquor.csv",parse_dates=[0])
sales

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [52]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   DATE           340 non-null    datetime64[ns]
 1   MRTSSM4453USN  340 non-null    int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 5.4 KB

In [53]:
sales['DATE'].dt.year

0      1992
1      1992
2      1992
3      1992
4      1992
       ...
335    2019
336    2020
337    2020
338    2020
339    2020
Name: DATE, Length: 340, dtype: int32

In [54]:
sales['DATE'].dt.month

0       1
1       2
2       3
3       4
4       5
       ..
335    12
336     1
337     2
338     3
339     4
Name: DATE, Length: 340, dtype: int32

In [55]:
sales['DATE'].dt.day

0      1
1      1
2      1
3      1
4      1
      ..
335    1
336    1
337    1
338    1
339    1
Name: DATE, Length: 340, dtype: int32

In [56]:
sales['DATE'].dt.day_name

In [57]:
sales['DATE'].dt.day_of_week

0      2
1      5
2      6
3      2
4      4
      ..
335    6
336    2
337    5
338    6
339    2
Name: DATE, Length: 340, dtype: int32